import org.w3c.dom.ls.LSOutput;

import java.util.Scanner;

public class gostFormula {

    public static void main(String[] args) {
        int P = 6; // Шаг резьбы
        int D = 32; // наружный диаметр резьбы

//        double esC = (-(125+11*P) / 1000.0); // верхнее отклонение
//        double esE = (-(50+11*P) / 1000.0); // верхнее отклонение
//        double esG = (-(15+11*P) / 1000.0); // верхнее отклонение

        double esC = -(125+11*P); // верхнее отклонение
        double esE = -(50+11*P); // верхнее отклонение
        double esG = -(15+11*P); // верхнее отклонение
        //System.out.println("Допуск для класса С = " + esC + ". " + "Допуск для класса Е = " + esE + ". " + "Допуск для класса G = " + esG + ". ");

        //double class4 = 0.63; //коэффициент
        double class7 = 1.25; //коэффициент
        double class8 = 1.6; //коэффициент
        double class9 = 2; //коэффициент

        double Td2 = 90 * (Math.pow(P, 0.4)) * (Math.pow(D, 0.1)); //средний диаметр

        double Td3_6e = 1.25 * Td2 + Math.abs(esE);            //внутренний диаметр для 6c класса
        double Td3_6g = 1.25 * Td2 + Math.abs(esG);            //внутренний диаметр для 6g класса
        double Td3_7e = 1.25 * (Td2 * class7) + Math.abs(esE); //внутренний диаметр для 7e класса
        double Td3_7g = 1.25 * (Td2 * class7) + Math.abs(esG); //внутренний диаметр для 7g класса
        double Td3_8c = 1.25 * (Td2 * class8) + Math.abs(esC); //внутренний диаметр для 8c класса
        double Td3_8e = 1.25 * (Td2 * class8) + Math.abs(esE); //внутренний диаметр для 8e класса
        double Td3_9c = 1.25 * (Td2 * class9) + Math.abs(esC); //внутренний диаметр для 9c класса

//        double Td = (Math.round((180 * Math.cbrt(Math.sqrt(P))) - (45 / Math.sqrt(P)) / 1.6) / 1000.0) * (-1); //наружный диаметр
        double Td = (Math.round((180 * Math.cbrt(Math.pow(P, 2)) - 45 / Math.sqrt(P)) / 1.6) /1000.0) * (-1); //наружный диаметр

//        Math.round((Math.abs(esE) + Td2)) / (1000.0 * (-1)));
//        System.out.println("Для трапецеидальной резьбы диаметром: " + D + "мм. И шагом: " + P + "мм.:");
        System.out.println("Допуск на наружный диаметр = " + Td);
        System.out.println("=======================================================================");
        System.out.println("=======================================================================");
        System.out.println("=======================================================================");
        System.out.println("Допуск на средний диаметр 6e класса точности = " + (esE / 1000.0) + "/" + Math.round(Td2)/1000.0*(-1));
        System.out.println("Допуск на средний диаметр 6g класса точности = " + (esG / 1000.0) + "/" + Math.round(Math.abs(esG) + Td2)/1000.0*(-1));
        System.out.println("=======================================================================");
        System.out.println("Допуск на средний диаметр 7e класса точности = " + (esE / 1000.0) + "/" + Math.round(Math.abs(esE) + (Td2 * 1.25))/1000.0 * (-1));
        System.out.println("Допуск на средний диаметр 7g класса точности = " + (esG / 1000.0) + "/" + Math.round(Math.abs(esG) + (Td2 * 1.25))/1000.0 * (-1));
        System.out.println("=======================================================================");
        System.out.println("Допуск на средний диаметр 8c класса точности = " + (esC / 1000.0) + "/" + Math.round(Math.abs(esC) + (Td2 * 1.6))/1000.0 * (-1));
        System.out.println("Допуск на средний диаметр 8e класса точности = " + (esE / 1000.0) + "/" + Math.round(Math.abs(esE) + (Td2 * 1.6))/1000.0 * (-1));
        System.out.println("=======================================================================");
        System.out.println("Допуск на средний диаметр 9c класса точности = " + (esC / 1000.0) + "/" + Math.round(Math.abs(esC) + (Td2 * 2))/1000.0 * (-1));
        System.out.println("=======================================================================");
        System.out.println("=======================================================================");
        System.out.println("=======================================================================");
        System.out.println("Допуск на внутренний диаметр для 6c класса = " + Math.round(Td3_6e)/1000.0 * (-1));
        System.out.println("Допуск на внутренний диаметр для 6e класса = " + Math.round(Td3_6g)/1000.0 * (-1));
        System.out.println("=======================================================================");
        System.out.println("Допуск на внутренний диаметр для 7e класса = " + Math.round(Td3_7e)/1000.0 * (-1));
        System.out.println("Допуск на внутренний диаметр для 7g класса = " + Math.round(Td3_7g)/1000.0 * (-1));
        System.out.println("=======================================================================");
        System.out.println("Допуск на внутренний диаметр для 8c класса = " + Math.round(Td3_8c)/1000.0 * (-1));
        System.out.println("Допуск на внутренний диаметр для 8e класса = " + Math.round(Td3_8e)/1000.0 * (-1));
        System.out.println("=======================================================================");
        System.out.println("Допуск на внутренний диаметр для 9c класса = " + Math.round(Td3_9c)/1000.0 * (-1));
        System.out.println("=======================================================================");
     }
}
